app/views/users/show.html.erb

  <div class="col-md-8">
    <% if @user.polls.any? %>
      <h3>Polls (<%= @user.polls.count %>)</h3>
---
SELECT "polls".* FROM "polls" WHERE "polls"."user_id" = ?  [["user_id", 8]]
SELECT  1 AS one FROM "polls" WHERE "polls"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "polls".* FROM "polls" WHERE "polls"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "polls" WHERE "polls"."user_id" = ?  [["user_id", 1]]