app/views/polls/show.html.erb

  <div class="col-md-12">
    <% if @poll.options.any? %>
      <h3>Options (<%= @poll.options.count %>)</h3>
---
SELECT "options".* FROM "options" WHERE "options"."poll_id" = ?  [["poll_id", 3]]
SELECT  1 AS one FROM "options" WHERE "options"."poll_id" = ? LIMIT ?  [["poll_id", 3], ["LIMIT", 1]]
SELECT COUNT(*) FROM "options" WHERE "options"."poll_id" = ?  [["poll_id", 3]]

   <tbody>
    <% @poll.options.each do |option| %>
---
SELECT "options".* FROM "options" WHERE "options"."poll_id" = ?  [["poll_id", 3]]