app/controllers/options_controller.rb

  def index
    @options = Option.all
---
SELECT "options".* FROM "options"

  def create
    @option = Option.new(option_params)

    # The if statement isn't working very well
    if !params[:add_option].nil?
      @option.save
      flash[:success] = 'Option added!'
      redirect_to @option.poll
    else
      respond_to do |format|
        if @option.save
---
INSERT INTO "options" ("poll_id", "name", "numVotes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["poll_id", 3], ["name", "Purple"], ["numVotes", 0], ["created_at", "2018-12-02 21:58:37.267446"], ["updated_at", "2018-12-02 21:58:37.267446"]]
INSERT INTO "options" ("poll_id", "name", "numVotes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["poll_id", 3], ["name", "Gray"], ["numVotes", 0], ["created_at", "2018-12-03 15:07:51.072167"], ["updated_at", "2018-12-03 15:07:51.072167"]]

    def set_option
      @option = Option.find(params[:id])
---
SELECT  "options".* FROM "options" WHERE "options"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]