app/controllers/polls_controller.rb

SELECT  "options".* FROM "options" WHERE "options"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "options" SET "numVotes" = ?, "updated_at" = ? WHERE "options"."id" = ?  [["numVotes", 1], ["updated_at", "2018-12-03 15:07:56.839302"], ["id", 4]]
---
  def vote



      if request.patch?
        option_ids = params[:option_ids] #.collect {|id| id.to_i}
        option_ids.each do |id|
          o = Option.find_by_id(id)
          o.update_attributes(numVotes: (o.numVotes+1))

INSERT INTO "polls" ("title", "description", "user_id", "created_at", "updated_at", "totalVotes") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @poll = Poll.new(poll_params)

    respond_to do |format|
      if @poll.save