app/controllers/polls_controller.rb

  def show


    @poll = Poll.find(params[:id])
    @options = @poll.options
    @new_option = Option.new(poll_id: @poll.id)

    if request.post?
      option_ids = params[:option_ids].collect {|id| id.to_i} if params[:option_ids]
      option_ids.each do |id|
        o = Option.find_by_id(id)
---
SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  "options".* FROM "options" WHERE "options"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    @poll = Poll.new(poll_params)

    respond_to do |format|
      if @poll.save
---
INSERT INTO "polls" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "t is for title"], ["description", "something"], ["user_id", 7], ["created_at", "2018-12-03 02:08:22.834956"], ["updated_at", "2018-12-03 02:08:22.834956"]]

  def destroy
    @poll.destroy
---
DELETE FROM "polls" WHERE "polls"."id" = ?  [["id", 6]]